//A) пустой массив;

let a = [];

//B) массив с тремя числовыми элементами;

let b = [10, 20 , 30];

//C) массив с тремя строковыми элементами;

let c = ['home', 'work', 'school'];

//D) массив с тремя строковыми и с тремя числовыми элементами;

let d = ['home', 'work', 'school', 10, 20 , 30];

//E) массив с именами всех твоих одногруппников;

let classmates = ['vishan', 'baysangur', 'muhammad', 'khamzat', 'adam', 'abu-bakar', 'shamil', 'deni'];

//F) массив, в котором есть число, строка, null, undefined, true и false

let f = [14, 'home', null, undefined, true, false];

//G) массив, внутри которого три пустых массива;

let g = [[],[],[],];

// mассив, внутри которого два массива, а внутри каждого вложенного массива любые три числа.

let x = [[1,2,3], [4,5,6],];
